In [1]:
import numpy as np 
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','ak','sk','mk'],
    "mark":[11,22,33,44]
}

In [3]:
pf = pd.DataFrame(dict1)

In [4]:
pf

    name  mark
0  harry    11
1     ak    22
2     sk    33
3     mk    44

In [5]:
pf.to_csv('college_data.csv')

In [6]:
pf.head(2)

    name  mark
0  harry    11
1     ak    22

In [7]:
pf.tail(2)

  name  mark
2   sk    33
3   mk    44

In [8]:
pf.describe()

            mark
count   4.000000
mean   27.500000
std    14.200939
min    11.000000
25%    19.250000
50%    27.500000
75%    35.750000
max    44.000000

In [9]:
pf.to_csv("abhi.csv")

In [10]:
abhi= pd.read_csv("abhi.csv")

In [11]:
abhi

   Unnamed: 0   name  mark
0           0  harry    11
1           1     ak    22
2           2     sk    33
3           3     mk    44

In [12]:
abhi["mark"][0]=88

C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_2544\2387285072.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  abhi["mark"][0]=88
C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_2544\2387285072.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  abhi["mark"][0]=88

In [13]:
abhi

   Unnamed: 0   name  mark
0           0  harry    88
1           1     ak    22
2           2     sk    33
3           3     mk    44

In [14]:
ser = pd.Series(np.random.rand(34))

In [15]:
type(ser)

pandas.core.series.Series

In [16]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [17]:
newdf

            0         1         2         3         4
0    0.844596  0.799046  0.052999  0.876712  0.638798
1    0.970217  0.235320  0.854488  0.067998  0.397493
2    0.656628  0.773831  0.650276  0.552670  0.029993
3    0.534275  0.715102  0.541488  0.163775  0.174539
4    0.009118  0.590053  0.050618  0.274798  0.818016
..        ...       ...       ...       ...       ...
329  0.129499  0.839370  0.994529  0.728293  0.785184
330  0.132956  0.808409  0.838623  0.087054  0.221517
331  0.878307  0.790556  0.773458  0.105497  0.408706
332  0.796782  0.096576  0.765144  0.934922  0.371731
333  0.196387  0.760748  0.790821  0.960515  0.342834

[334 rows x 5 columns]

In [18]:
newdf.head()

          0         1         2         3         4
0  0.844596  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [19]:
newdf[0][0] = "Sahil"

C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_2544\4075100685.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "Sahil"
C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_2544\4075100685.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Sahil' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "Sahil"

In [20]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [21]:
newdf.head()

          0         1         2         3         4
0     Sahil  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [22]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [23]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [24]:
newdf.to_numpy()

array([['Sahil', 0.799045944540385, 0.05299854719696484,
        0.876711940211663, 0.6387975259175898],
       [0.9702166166845884, 0.23532009610470994, 0.8544881138023714,
        0.06799750455794062, 0.39749310097346435],
       [0.6566275146776197, 0.7738311045708905, 0.6502762226429066,
        0.5526703180988596, 0.0299930118125592],
       ...,
       [0.8783069005600361, 0.7905557840498579, 0.7734583394005942,
        0.10549697599680674, 0.40870597629600924],
       [0.7967822235894868, 0.09657635838381384, 0.7651438814075392,
        0.9349219648734874, 0.37173075977017733],
       [0.1963866886917477, 0.7607481293709483, 0.7908210565507502,
        0.9605145159967003, 0.34283420927391683]],
      shape=(334, 5), dtype=object)

In [25]:
newdf.head()

          0         1         2         3         4
0     Sahil  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [26]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Sahil,0.970217,0.656628,0.534275,0.009118,0.622871,0.888325,0.592698,0.154544,0.926229,...,0.69374,0.950308,0.440194,0.830981,0.874608,0.129499,0.132956,0.878307,0.796782,0.196387
1,0.799046,0.23532,0.773831,0.715102,0.590053,0.835265,0.256094,0.080416,0.509367,0.528723,...,0.382883,0.780225,0.272872,0.953276,0.386638,0.83937,0.808409,0.790556,0.096576,0.760748
2,0.052999,0.854488,0.650276,0.541488,0.050618,0.142852,0.555932,0.327135,0.396979,0.705567,...,0.754175,0.069465,0.460321,0.029647,0.623233,0.994529,0.838623,0.773458,0.765144,0.790821
3,0.876712,0.067998,0.55267,0.163775,0.274798,0.740799,0.788375,0.76062,0.02137,0.317742,...,0.814713,0.602927,0.265501,0.652959,0.792967,0.728293,0.087054,0.105497,0.934922,0.960515
4,0.638798,0.397493,0.029993,0.174539,0.818016,0.789013,0.985347,0.437401,0.575776,0.358576,...,0.424872,0.700856,0.647596,0.195549,0.422191,0.785184,0.221517,0.408706,0.371731,0.342834

In [27]:
newdf.head()

          0         1         2         3         4
0     Sahil  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [28]:
newdf[0][0] = "0.3"

In [29]:
newdf

            0         1         2         3         4
0         0.3  0.799046  0.052999  0.876712  0.638798
1    0.970217  0.235320  0.854488  0.067998  0.397493
2    0.656628  0.773831  0.650276  0.552670  0.029993
3    0.534275  0.715102  0.541488  0.163775  0.174539
4    0.009118  0.590053  0.050618  0.274798  0.818016
..        ...       ...       ...       ...       ...
329  0.129499  0.839370  0.994529  0.728293  0.785184
330  0.132956  0.808409  0.838623  0.087054  0.221517
331  0.878307  0.790556  0.773458  0.105497  0.408706
332  0.796782  0.096576  0.765144  0.934922  0.371731
333  0.196387  0.760748  0.790821  0.960515  0.342834

[334 rows x 5 columns]

In [30]:
newdf.head()

          0         1         2         3         4
0       0.3  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [31]:
newdf.sort_index(axis=0, ascending= False)

            0         1         2         3         4
333  0.196387  0.760748  0.790821  0.960515  0.342834
332  0.796782  0.096576  0.765144  0.934922  0.371731
331  0.878307  0.790556  0.773458  0.105497  0.408706
330  0.132956  0.808409  0.838623  0.087054  0.221517
329  0.129499  0.839370  0.994529  0.728293  0.785184
..        ...       ...       ...       ...       ...
4    0.009118  0.590053  0.050618  0.274798  0.818016
3    0.534275  0.715102  0.541488  0.163775  0.174539
2    0.656628  0.773831  0.650276  0.552670  0.029993
1    0.970217  0.235320  0.854488  0.067998  0.397493
0         0.3  0.799046  0.052999  0.876712  0.638798

[334 rows x 5 columns]

In [32]:
newdf.sort_index(axis=1, ascending= False)

            4         3         2         1         0
0    0.638798  0.876712  0.052999  0.799046       0.3
1    0.397493  0.067998  0.854488  0.235320  0.970217
2    0.029993  0.552670  0.650276  0.773831  0.656628
3    0.174539  0.163775  0.541488  0.715102  0.534275
4    0.818016  0.274798  0.050618  0.590053  0.009118
..        ...       ...       ...       ...       ...
329  0.785184  0.728293  0.994529  0.839370  0.129499
330  0.221517  0.087054  0.838623  0.808409  0.132956
331  0.408706  0.105497  0.773458  0.790556  0.878307
332  0.371731  0.934922  0.765144  0.096576  0.796782
333  0.342834  0.960515  0.790821  0.760748  0.196387

[334 rows x 5 columns]

In [33]:
newdf[0]

0           0.3
1      0.970217
2      0.656628
3      0.534275
4      0.009118
         ...
329    0.129499
330    0.132956
331    0.878307
332    0.796782
333    0.196387
Name: 0, Length: 334, dtype: object

In [34]:
newdf.head()

          0         1         2         3         4
0       0.3  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [35]:
newdf.loc[0,0]= 654

In [36]:
newdf.head(2)

          0         1         2         3         4
0       654  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493

In [37]:
newdf.columns = list("ABCDE")

In [38]:
newdf.head(2)

          A         B         C         D         E
0       654  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493

In [39]:
newdf.loc[0,0]=654

In [40]:
newdf.head()

          A         B         C         D         E      0
0       654  0.799046  0.052999  0.876712  0.638798  654.0
1  0.970217  0.235320  0.854488  0.067998  0.397493    NaN
2  0.656628  0.773831  0.650276  0.552670  0.029993    NaN
3  0.534275  0.715102  0.541488  0.163775  0.174539    NaN
4  0.009118  0.590053  0.050618  0.274798  0.818016    NaN

In [41]:
newdf=newdf.drop(0,axis=1)

In [42]:
newdf.head()

          A         B         C         D         E
0       654  0.799046  0.052999  0.876712  0.638798
1  0.970217  0.235320  0.854488  0.067998  0.397493
2  0.656628  0.773831  0.650276  0.552670  0.029993
3  0.534275  0.715102  0.541488  0.163775  0.174539
4  0.009118  0.590053  0.050618  0.274798  0.818016

In [43]:
newdf.loc[[0,2],['C','d']]

KeyError: "['d'] not in index"